function out = zech( i )
%ZECH    Таблица Zech-а для сложения элементов поля
%        в мультипликативном представлении.
%    i - степень примитивного элемента(alpha^i)
%    out = 1 + alpha^i

zech_table = [14;
   			  28;
   				5;
   	        25;
               3;
   			  10;
   			  16;
   			  19;
   			  24;
               6;
              23;
              20;
              30;
               1;
              22;
               7;
              18;
              17;
               8;
              12;
              27;
              15;
              11;
               9;
               4;
              29;
              21;
               2;
              26;
              13];
           
  out = zech_table(i);           